Тест/src/Documents/ОтключенныеАбоненты/ОтключенныеАбоненты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтключенныеАбоненты</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Балансодержатель</name>
    <type>
      <types>CatalogRef.Балансодержатели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЖилья</name>
    <type>
      <types>EnumRef.ВидыЖилья</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПускаОриентировочная</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДомМногоквартирный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаселенныйПункт</name>
    <type>
      <types>CatalogRef.НаселенныеПункты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеВключил</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОтключил</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНевозобновления</name>
    <type>
      <types>CatalogRef.ПричиныОтключения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтключения</name>
    <type>
      <types>CatalogRef.ПричиныОтключения</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонГорода</name>
    <type>
      <types>CatalogRef.РайоныГорода</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Улица</name>
    <type>
      <types>CatalogRef.Улицы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьАдрес</name>
    <attributes>
      <name>НарушенияУстранены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корпус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квартира</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНевозобновления</name>
      <type>
        <types>CatalogRef.ПричиныНевозобновления</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/src/Enums/ВидыЖилья/ВидыЖилья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЖилья</name>
  <enumValues>
    <name>Многоквартирный</name>
  </enumValues>
  <enumValues>
    <name>Одноквартирний</name>
  </enumValues>
</mdclass:Enum>

Тест/src/Documents/ОтключенныеАбоненты/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьРеквизиты();
	УстановитьВидимость();
	ДоступностьТЧНарушенияУстранены();
	ДоступностьДатыПуска();
	//ЗаполнитьОтветственного();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЖильяПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Функция ДоступностьТЧНарушенияУстранены()
	
	//Если НЕ (ЗначениеЗаполнено(Нарушения)) Тогда
	//	ЭтаФорма.Элементы.ТабличнаяЧастьАдресНарушенияУстранены.Доступность = Ложь;
	//Иначе
	//	ЭтаФорма.Элементы.ТабличнаяЧастьАдресНарушенияУстранены.Доступность = Истина;
	//КонецЕсли;
	
КонецФункции

//Установить видимость реквизита дата пуска, если нарушения устранены
&НаКлиенте
Функция ДоступностьДатыПуска()
	
	Нарушения = Объект.Описание;
	
	Если НЕ (ЗначениеЗаполнено(Нарушения)) Тогда
		ЭтаФорма.Элементы.ДатаПуска.Доступность = Истина;
	Иначе
		ЭтаФорма.Элементы.ДатаПуска.Доступность = Ложь;
	КонецЕсли;
КонецФункции

//Установить видимость реквизитов в зависимости от вида жилья
&НаКлиенте
Функция УстановитьВидимость()
		ВидЖильяМногокв = Объект.ВидЖилья;
	
	Если НЕ ВидЖильяМногокв = ПредопределенноеЗначение("Перечисление.ВидыЖилья.Многоквартирный") Тогда
		ЭтаФорма.Элементы.ДомМногоквартирный.Видимость = Ложь;
		ЭтаФорма.Элементы.ТабличнаяЧастьАдресКорпус.Видимость = Ложь;
		ЭтаФорма.Элементы.ТабличнаяЧастьАдресДом.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ДомМногоквартирный.Видимость = Истина;
		ЭтаФорма.Элементы.ТабличнаяЧастьАдресДом.Видимость = Ложь;
		ЭтаФорма.Элементы.ТабличнаяЧастьАдресКорпус.Видимость = Истина;
	КонецЕсли;
	
КонецФункции

//Заполнить реквизит автор пользователем изменявшим документ
&НаСервере
Процедура ЗаполнитьОтветственного()
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

//Заполнить реквизит адрес и ответственный
&НаСервере
Процедура ЗаполнитьРеквизиты()
	ВидЖильяМногокв = Объект.ВидЖилья;	
	АдресТЧ = "";
	РеквОписание = "";
	
	//Формирование части адреса и описания с ТЧ документа
	Для каждого ТекущаяСтрока Из Объект.ТабличнаяЧастьАдрес Цикл
		
		ТЧДом = ТекущаяСтрока.Дом;
		ТЧКорпус = ТекущаяСтрока.Корпус;	
		ТЧКвартира = ТекущаяСтрока.Квартира;
		ТЧНарушенияУстранены = ТекущаяСтрока.НарушенияУстранены;
		ТЧПричинаНевозобновления = ТекущаяСтрока.ПричинаНевозобновления;
		
		Если ВидЖильяМногокв = ПредопределенноеЗначение("Перечисление.ВидыЖилья.Многоквартирный") Тогда	
			Если НЕ (ЗначениеЗаполнено(ТЧКорпус)) Тогда
				ТекущаяСтрока.Дом = Объект.ДомМногоквартирный;
				АдресТЧ = АдресТЧ + ", "+ ТЧКвартира;
				
				
				Если (ЗначениеЗаполнено(ТЧПричинаНевозобновления)) Тогда
					Если ТЧНарушенияУстранены = Ложь Тогда
						РеквОписание = РеквОписание + "кв. " + ТЧКвартира + " - " + ТЧПричинаНевозобновления + Символы.ПС;
					КонецЕсли;
				КонецЕсли;
			Иначе 
				ТекущаяСтрока.Дом = Объект.ДомМногоквартирный;
				АдресТЧ = АдресТЧ + ", " + ТЧКорпус + "/" + ТЧКвартира;
				
				Если (ЗначениеЗаполнено(ТЧПричинаНевозобновления)) Тогда
					Если ТЧНарушенияУстранены = Ложь Тогда
						РеквОписание = РеквОписание +  "корп/кв. " + ТЧКорпус + "/" + ТЧКвартира + " - " + ТЧПричинаНевозобновления + Символы.ПС;
						КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если НЕ (ЗначениеЗаполнено(ТЧДом)) Тогда
				АдресТЧ = АдресТЧ + ", " + ТЧКвартира;
				
				Если (ЗначениеЗаполнено(ТЧПричинаНевозобновления)) Тогда
					Если ТЧНарушенияУстранены = Ложь Тогда
						РеквОписание = РеквОписание +  "кв. " + ТЧКвартира + " - " + ТЧПричинаНевозобновления + Символы.ПС;
						КонецЕсли;
				КонецЕсли;
			Иначе
				АдресТЧ = АдресТЧ + ", " + ТЧДом + "/" + ТЧКвартира;
				Если (ЗначениеЗаполнено(ТЧПричинаНевозобновления)) Тогда
					Если ТЧНарушенияУстранены = Ложь Тогда
						РеквОписание = РеквОписание +  "дом/кв. " + ТЧДом + "/" + ТЧКвартира + " - " + ТЧПричинаНевозобновления + Символы.ПС;
						КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	РеквНаселенныйПункт = Объект.НаселенныйПункт.Наименование;
	РеквНаселенныйПунктТип = Объект.НаселенныйПункт.ТипНаселенногоПункта.Наименование;
	РеквРайонГорода = Объект.РайонГорода.Наименование;
	РеквУлица = Объект.Улица.Наименование;
	РеквУлицаТип = Объект.Улица.ТипУлицы.НаименованиеКратное;
	РеквДомКв = Объект.ДомМногоквартирный;
	
	//Заполнение реквизита адрес для многоквартирных домов	
	Если ВидЖильяМногокв = ПредопределенноеЗначение("Перечисление.ВидыЖилья.Многоквартирный") Тогда
		Объект.Адрес = ?(НЕ ПустаяСтрока(РеквНаселенныйПункт), РеквНаселенныйПунктТип + " "
		+ РеквНаселенныйПункт , "") + ?(НЕ ПустаяСтрока(РеквРайонГорода),", " + РеквРайонГорода,"")
		+ ?(НЕ ПустаяСтрока(РеквУлица), ", " + РеквУлицаТип + " " + РеквУлица, "") 
		+ ?(НЕ ПустаяСтрока(РеквДомКв), ", буд. " + РеквДомКв + ", корп/кв " + АдресТЧ, "");
	//Заполнение реквизита адрес для ч/с	
	Иначе 
		Объект.Адрес = ?(НЕ ПустаяСтрока(РеквНаселенныйПункт), РеквНаселенныйПунктТип + " "
		+ РеквНаселенныйПункт , "") + ?(НЕ ПустаяСтрока(РеквРайонГорода),", " + РеквРайонГорода,"")
		+ ?(НЕ ПустаяСтрока(РеквУлица), ", " + РеквУлицаТип + " " + РеквУлица + ", буд/кв " + АдресТЧ, "");			
	КонецЕсли;
	
	Объект.Описание = РеквОписание;
	
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктПриИзменении(Элемент)
	ЗаполнитьРеквизиты();
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	ЗаполнитьРеквизиты();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьРеквизиты();
	//Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьАдресПриИзменении(Элемент)
	ДоступностьТЧНарушенияУстранены();
	ЗаполнитьРеквизиты();
	ДоступностьДатыПуска();
КонецПроцедуры
